<?php
/***************************************************/
// UADate version 0.48/Alpha	
// ------------------------------------------------------
// Copyright (C) 2008-2013 DaK studio
// 	EMail: DaKstudio@ukr.net 
//	http://Dakstudio.ltd.ua
//     Released under the terms and conditions of the
//     GNU General Public License (http://gnu.org).
//   $Source: http://calendarUA.sourceforge.net/ $
//   $Revision: 0.4 $
//   $Date: 20-01-2013  23:28:48 $
//   $Author: LnceloT $
/***************************************************/ 
error_reporting(0); // Вимкнути повідомлення про  помилки
	define('N_MONTH', date("m"));		// Номер місяця
	define('N_WEEK', date("w"));		// Номер  дня неділі
	define('N_MDAY', date("d"));		// Число
	define('N_YEAR',date("Y"));		// рік
	define('N_LPS',"<br><a href='http://DaKstudio.ltd.ua/' style='font-size:7px;'>DaK studio &copy; </a>");

function UAdateL($ua_w,$ua_w_s,$ua_m_s){
	//масив днів Тижня-Повна назва
	$ua_w = array(
		'0'=>"неділя",
		'1'=>"понеділок",
		'2'=>"вівіторок",
		'3'=>"середа",
		'4'=>"четвер",
		'5'=>"п`ятниця",
		'6'=>"субота"
	);
	//масив днів Тижня -Коротка назва
	$ua_w_s = array(
		'0'=>"нд",
		'1'=>"пн",
		'2'=>"вт",
		'3'=>"ср",
		'4'=>"чт",
		'5'=>"пт",
		'6'=>"сб"
	);
	//масив Місяців- -Коротка назва
	$ua_m_s = array(
		'01'=>"січ",
		'02'=>"лют",
		'03'=>"бер",
		'04'=>"кві",
		'05'=>"тра",
		'06'=>"чер",
		'07'=>"лип",
		'08'=>"срп",
		'09'=>"вер",
		'10'=>"жов",
		'11'=>"лис",
		'12'=>"гру"
	);
	return array ($ua_w,$ua_w_s,$ua_m_s);
}

function UAdate($Dinp) {
	// Вхідні дані(аргументи):
	// $Dinp [ string] -обовязково, передає шаблон відтворення Дати і Часу 
	// синтаксис аргументів від функції в PHP - date();
	// Особливість,можна в шаблон вмонтовувати текст, приклад - "Сьогодні l, d F Y року, зараз H:i хвилин."
//UA	
if ($Dinp===false){ return $result=false;}
	//масив Місяців-Повна назва
	$ua_m = array(
		'01'=>"січня",
		'02'=>"лютого",
		'03'=>"березня",
		'04'=>"квітня",
		'05'=>"травня",
		'06'=>"червня",
		'07'=>"липня",
		'08'=>"серпня",
		'09'=>"вересня",
		'10'=>"жовтня",
		'11'=>"листопада",
		'12'=>"грудня"
	);
list($ua_w,$ua_w_s,$ua_m_s)=UAdateL($ua_w,$ua_w_s,$ua_m_s);

	$out_dates = array(
		$ua_w[N_WEEK],		// Назва дня тижня UA
		$ua_m[N_MONTH],		// Назва місяця UA
		date("H"),			// Години (формат 1 - H)
		date("i"),			// Хвилини (формат 1 - i)
		date("Y"),			// Рік  (4)- повний формат
		date("y"),			// Рік (2)- короткий формат
		date("d"),			// Число
		$ua_w_s[N_WEEK],	// коротка назва дня неділі
		$ua_m_s[N_MONTH],	// коротка назва місяця
		date("s")			// секунди
	);
	//масив вхідних аргументів  в шаблоні -  яку  "БУКВУ"(аргумент)  заміняти  на  яке  "ЗначенняUA"
	$in_dates = array(
		"[l]", // день тижня Повна назва
		"[F]", //місяць  Повна назва 
		"[H]", //години формат-24
		"[i]", //хвилини
		"[Y]", // рік - 4 цифри
		"[y]", // рік - 2 цифри
		"[d]", // число -день місяця 
		"[D]", //день тижня Коротка назва
		"[M]", //місяць Коротка назва
		"[s]"  //секунди
	);
	
	$replaceReg= preg_replace("%(\W)([a-zA-Z])(?=[\W])%is","\\1[\\2]\\3",$Dinp); // Парсування вхідного шаблону дати на UA для перезапису в шаблоні
	$result = str_replace($in_dates, $out_dates, $replaceReg);
	return $result;
}

function UAdateD($Dinp,$manth,$weekDay) {
	// Вхідні дані(аргументи):
	// $Dinp [ string] -обовязково, передає шаблон відтворення Дати і Часу
	//$manth[integer]
	//$weekDay[integer]
//якщо аргументи менше 0 чи більше (12 чи 6),встновлюємо теперішню  дату 
if ($Dinp===false){ return $result=false;}
if (($manth<0 & $manth>12) | ($weekDay<0 & $weekDay>6)){
$manth=N_MONTH;
$weekDay=N_WEEK;}
//UA	
	//масив Місяців-Повна назва
	$ua_m = array(
		'1'=>"січень",
		'2'=>"лютий",
		'3'=>"березень",
		'4'=>"квітень",
		'5'=>"травень",
		'6'=>"червень",
		'7'=>"липень",
		'8'=>"серпень",
		'9'=>"вересень",
		'10'=>"жовтень",
		'11'=>"листопад",
		'12'=>"грудень"
	);
 list($ua_w,$ua_w_s,$ua_m_s)=UAdateL($ua_w,$ua_w_s,$ua_m_s);
 
	//визначаємо константи  дати
	$out_dates = array(
		$ua_w[$weekDay],		// Назва дня тижня UA
		$ua_m[$manth],		// Назва місяця UA
		date("H"),			// Години (формат 1 - H)
		date("i"),			// Хвилини (формат 1 - i)
		date("Y"),			// Рік  (4)- повний формат
		date("y"),			// Рік (2)- короткий формат
		date("d"),			// Число
		$ua_w_s[$weekDay],	// коротка назва дня неділі
		$ua_m_s[$manth],	// коротка назва місяця
		date("s")			// секунди
	);
	//масив вхідних аргументів  в шаблоні -  яку  "БУКВУ"(аргумент)  заміняти  на  яке  "ЗначенняUA"
	$in_dates = array(
		"[l]", // день тижня Повна назва
		"[F]", //місяць  Повна назва 
		"[H]", //години формат-24
		"[i]", //хвилини
		"[Y]", // рік - 4 цифри
		"[y]", // рік - 2 цифри
		"[d]", // число -день місяця 
		"[D]", //день тижня Коротка назва
		"[M]", //місяць Коротка назва
		"[s]"  //секунди
	);
	
	$replaceReg= preg_replace("%(\W)([a-zA-Z])(?=[\W])%is","\\1[\\2]\\3",$Dinp); // Парсування вхідного шаблону дати на UA для перезапису в шаблоні
	$result = str_replace($in_dates, $out_dates, $replaceReg);
	return $result;
}

?>